rtkconnectivity/rtl8752h_sdk/src/app/ppt_driver/common/ppt_driver.c
/**
*****************************************************************************************
*     Copyright(c) 2025, Realtek Semiconductor Corporation. All rights reserved.

*
*     SPDX-License-Identifier: LicenseRef-Realtek-5-Clause
*****************************************************************************************
  * @file     ppt_driver.c
  * @brief    Source file for 2.4G module common driver.
  * @details
  * @author   Bill
  * @date     2025-12-1
  * @version  v1.0
  ***************************************************************************************
  * @attention
  * <h2><center>&copy; COPYRIGHT 2025 Realtek Semiconductor Corporation</center></h2>
  ***************************************************************************************
  */

#include <stdbool.h>
#include "trace.h"
#include "rtl876x.h"
#include "rtl876x_pinmux.h"
#include "platform_utils.h"
#include "os_sync.h"
#include "ppt_driver.h"

#include "dlps.h"
//#include "power_manager_interface.h"
//#include "power_manager_slave.h"
//#include "power_manager_unit_platform.h"
#include "os_mem.h"

#define PPT_LOG_METHOD                      0 //!< 0: no log, 1: buffer log, 2: direct log
#define PPT_REG_ACCESS_TIM_DBG              (TIME_DEBUG && 0)
#define PPT_WR_WI_RD_BACK                   0

#define PPT_IS_ASIC                         0
#define PATCH_BTMAC_ISR                     1

#define BLUEWIZ_REG_BASE                    0x40050000UL
#define PPT_REG_ADDR_BASE                   (BLUEWIZ_REG_BASE + 0x1c00)

#ifndef UNUSED
#define UNUSED(expr) do { (void)(expr); } while (0)
#endif

void bt_retention_domain_reset(void);

bool ppt_enable = false;
volatile bool ppt_dlps_mac_idle = true;
bool (*ppt_dlps_mac_check_cb)(uint32_t *wakeup_time_diff);
void (*ppt_dlps_mac_enter_cb)(void);
void (*ppt_dlps_mac_exit_cb)(void);
void (*ppt_dlps_pf_enter_cb)(void);
void (*ppt_dlps_pf_exit_cb)(void);
bool ppt_tx_fixed_rptr[PPT_ENTRY_NUM];

struct
{
    uint32_t modem_acc[PPT_ENTRY_RX_NUM];
    uint8_t modem_acc_enable;
    uint8_t acc_byte3_flag; //!< 0: not set, 1: set for 1M, 2: set for 2M
    bool acc_similar_flag;
    bool mod_index_2m_flag;
} ppt_fw_ret;

#if PATCH_BTMAC_ISR
void *btmac_handler_temp;
#endif
void *bb_psd_handler_temp;

static void (*ppt_isr_handler)(void);
static void (*ppt_psd_isr_handler)(void);

#if TIME_DEBUG
uint8_t test_pin[] = {TEST_PIN};
uint32_t gpio_test_pin[sizeof(test_pin)];
bool level_test_pin[sizeof(test_pin)];
#endif

static PPT_DAT_SECTION ppt_reg_field_t ppt_lut_prefix[PPT_ENTRY_RX_NUM] =
{
    {PRO_PREFIX0_1, 0}, {PRO_PREFIX0_1, 8},
    {PRO_PREFIX2_3, 0}, {PRO_PREFIX2_3, 8},
    {PRO_PREFIX4_5, 0}, {PRO_PREFIX4_5, 8},
    {PRO_PREFIX6_7, 0}, {PRO_TX_ADDRESS_UPPER, 8}
};

static PPT_DAT_SECTION uint16_t ppt_lut_tx_addr[PPT_ENTRY_RX_NUM] =
{
    PRO_TX_ADDRESS_LOWER, PRO_TX_ADDRESS1_LOWER,
    PRO_TX_ADDRESS2_LOWER, PRO_TX_ADDRESS3_LOWER,
    PRO_TX_ADDRESS4_LOWER, PRO_TX_ADDRESS5_LOWER,
    PRO_TX_ADDRESS6_LOWER, PRO_TX_ADDRESS7_LOWER,
};

PPT_API_SECTION uint8_t ppt_swap_bits8(uint8_t inp)
{
    uint8_t retval = 0;
    for (uint8_t i = 0; i < 8; i++)
    {
        retval |= ((inp >> i) & 0x01) << (7 - i);
    }
    return retval;
}

PPT_API_SECTION uint16_t ppt_swap_bits16(uint16_t inp)
{
    uint16_t retval = 0;
    for (uint8_t i = 0; i < 16; i++)
    {
        retval |= ((inp >> i) & 0x01) << (15 - i);
    }
    return retval;
}

PPT_API_SECTION uint32_t ppt_swap_bits24(uint32_t inp)
{
    uint32_t retval = 0;
    for (uint8_t i = 0; i < 24; i++)
    {
        retval |= ((inp >> i) & 0x01) << (23 - i);
    }
    return retval;
}

PPT_API_SECTION uint32_t ppt_swap_bits32(uint32_t inp)
{
    uint32_t retval = 0;
    for (uint8_t i = 0; i < 32; i++)
    {
        retval |= ((inp >> i) & 0x01) << (31 - i);
    }
    return retval;
}

bool btmac_pm_check_inactive(void);
bool btmac_pm_check_active(void);
void btmac_pm_initiate_wakeup(void);
bool ppt_dlps_check_active(void);
bool ppt_dlps_check_inactive(void);
void ppt_dlps_initiate_wakeup(void);

PPT_API_SECTION uint16_t ppt_read_reg_dlps(uint16_t offset)
{
    uint16_t reg;

    /* wake up btmac */
    if (btmac_pm_check_inactive())
    {
        btmac_pm_initiate_wakeup();
    }
    /* wake up ppt */
    if (ppt_dlps_check_inactive())
    {
        ppt_dlps_initiate_wakeup();
    }

#if PPT_REG_ACCESS_TIM_DBG
    time_debug_level_high(TIME_DEBUG_CHAN_THREAD);
#endif
    reg = HAL_READ16(PPT_REG_ADDR_BASE, offset);
#if PPT_REG_ACCESS_TIM_DBG
    time_debug_level_low(TIME_DEBUG_CHAN_THREAD);
#endif

#if PPT_LOG_METHOD == 2
    DBG_DIRECT("PPTR %04x=%04x", offset, reg);
#elif PPT_LOG_METHOD == 1
    APP_PRINT_INFO2("ppt_read_reg: offset 0x%04x, value 0x%04x", offset, reg);
#endif
    return reg;
}

PPT_API_SECTION uint16_t ppt_read_reg_active(uint16_t offset)
{
    return HAL_READ16(PPT_REG_ADDR_BASE, offset);
}

PPT_API_SECTION void ppt_write_reg_dlps(uint16_t offset, uint16_t data)
{
    /* wake up btmac */
    if (btmac_pm_check_inactive())
    {
        btmac_pm_initiate_wakeup();
    }
    /* wake up ppt */
    if (ppt_dlps_check_inactive())
    {
        ppt_dlps_initiate_wakeup();
    }

#if PPT_REG_ACCESS_TIM_DBG
    time_debug_level_high(TIME_DEBUG_CHAN_THREAD);
#endif
    HAL_WRITE16(PPT_REG_ADDR_BASE, offset, data);
#if PPT_REG_ACCESS_TIM_DBG
    time_debug_level_low(TIME_DEBUG_CHAN_THREAD);
#endif

#if PPT_LOG_METHOD
    uint16_t read_data = 0;
#if PPT_WR_WI_RD_BACK
    read_data = ppt_read_reg(offset);
#endif
#endif
#if PPT_LOG_METHOD == 2
    DBG_DIRECT("PPTW %04x=%04x(r%04x)", offset, data, read_data);
#elif PPT_LOG_METHOD == 1
    APP_PRINT_INFO3("ppt_write_reg: offset 0x%04x, value 0x%04x(r%04x)", offset, data, read_data);
#endif
}

PPT_API_SECTION void ppt_write_reg_active(uint16_t offset, uint16_t data)
{
    HAL_WRITE16(PPT_REG_ADDR_BASE, offset, data);
}

uint16_t ppt_read_reg_def(uint16_t offset)
{
    ppt_read_reg = ppt_read_reg_active;
    ppt_write_reg = ppt_write_reg_active;
    return ppt_read_reg_dlps(offset);
}

