rtkconnectivity/rtl8752h_sdk/src/app/ppt_driver/common/ppt_driver.c
void ppt_write_reg_def(uint16_t offset, uint16_t data)
{
    ppt_read_reg = ppt_read_reg_active;
    ppt_write_reg = ppt_write_reg_active;
    ppt_write_reg_dlps(offset, data);
}

uint16_t (*ppt_read_reg)(uint16_t offset) = ppt_read_reg_def;
void (*ppt_write_reg)(uint16_t offset, uint16_t data) = ppt_write_reg_def;

PPT_API_SECTION void ppt_reset_core_domain(bool ppt_mode)
{
    {
        /* proprietary reset */
        BT_SYS_CTRL_REG_S_TYPE bt_sys_reg;
        bt_sys_reg.d32 = VENDOR_READ(BT_SYS_CTRL_REG);
        bt_sys_reg.b.pro_rst_n = 0;
        VENDOR_WRITE(BT_SYS_CTRL_REG, bt_sys_reg.d32);

        bt_sys_reg.b.pro_rst_n = 1;
        VENDOR_WRITE(BT_SYS_CTRL_REG, bt_sys_reg.d32);
    }

    {
        /* clock enable */
        BT_SYS_CTRL_REG_S_TYPE bt_sys_reg;
        bt_sys_reg.d32 = VENDOR_READ(BT_SYS_CTRL_REG);
        bt_sys_reg.b.pro_clk_en = ppt_mode;
        VENDOR_WRITE(BT_SYS_CTRL_REG, bt_sys_reg.d32);
        platform_delay_us(2);
    }
    ppt_enable = ppt_mode;
}

PPT_API_SECTION void ppt_lock(uint8_t entry, bool lock)
{
    assert_param(entry < PPT_ENTRY_NUM);

    if (entry <= 1)
    {
        PRO_TX_CONTROL_TYPE tx_ctrl = {.d16 = RD_PPT_REG(PRO_TX_CONTROL)};
        if (entry == 0)
        {
            tx_ctrl.lock0 = lock;
        }
        else if (entry == 1)
        {
            tx_ctrl.lock1 = lock;
        }
        WR_PPT_REG(PRO_TX_CONTROL, tx_ctrl.d16);
    }
    else if (entry == 2)
    {
        PRO_GPIO_CONTROL_TYPE gpio_ctrl = {.d16 = RD_PPT_REG(PRO_GPIO_CONTROL)};
        gpio_ctrl.lock2 = lock;
        WR_PPT_REG(PRO_GPIO_CONTROL, gpio_ctrl.d16);
    }
    else
    {
        uint16_t offset = PRO_WHITE_FIELD_LENGTH_0 + ((entry - PPT_ENTRY_NUM_ORI) << 1);
        PRO_WHITE_FIELD_LENGTH_0_TYPE len0 = {.d16 = RD_PPT_REG(offset)};
        len0.lock3 = lock;
        WR_PPT_REG(offset, len0.d16);
    }
}

void ppt_set_auto_no_tx(uint8_t entry, bool enable)
{
    assert_param(entry < PPT_ENTRY_NUM);
    uint16_t pro_reg;
    if (entry == 0)
    {
        pro_reg = RD_PPT_REG(PRO_TX_CONTROL);
        ((PRO_TX_CONTROL_TYPE *)(&pro_reg))->auto_no_tx_option0 = enable;
        WR_PPT_REG(PRO_TX_CONTROL, pro_reg);
    }
    else if (entry == 1)
    {
        pro_reg = RD_PPT_REG(PRO_TRX_CONTROL);
        ((PRO_TRX_CONTROL_TYPE *)(&pro_reg))->auto_no_tx_option1 = enable;
        WR_PPT_REG(PRO_TRX_CONTROL, pro_reg);
    }
    else if (entry == 2)
    {
        pro_reg = RD_PPT_REG(PRO_GPIO_CONTROL);
        ((PRO_GPIO_CONTROL_TYPE *)(&pro_reg))->auto_no_tx_option2 = enable;
        WR_PPT_REG(PRO_GPIO_CONTROL, pro_reg);
    }
    else
    {
        uint16_t offset = PRO_WHITE_FIELD_LENGTH_0 + ((entry - PPT_ENTRY_NUM_ORI) << 1);
        PRO_WHITE_FIELD_LENGTH_0_TYPE len0 = {.d16 = RD_PPT_REG(offset)};
        len0.auto_no_tx_option3 = enable;
        WR_PPT_REG(offset, len0.d16);
    }
}

void ppt_clear_hw_no_tx(uint8_t entry)
{
    assert_param(entry < PPT_ENTRY_NUM);
    if (entry <= 1)
    {
        PRO_TX_CONTROL_TYPE tx_ctrl = {.d16 = RD_PPT_REG(PRO_TX_CONTROL)};
        if (entry == 0)
        {
            tx_ctrl.clear_hw_no_tx0 = 1;
        }
        else if (entry == 1)
        {
            tx_ctrl.clear_hw_no_tx1 = 1;
        }
        WR_PPT_REG(PRO_TX_CONTROL, tx_ctrl.d16);
    }
    else if (entry == 2)
    {
        PRO_GPIO_CONTROL_TYPE gpio_ctrl = {.d16 = RD_PPT_REG(PRO_GPIO_CONTROL)};
        gpio_ctrl.clear_hw_no_tx2 = 1;
        WR_PPT_REG(PRO_GPIO_CONTROL, gpio_ctrl.d16);
    }
    else
    {
        uint16_t offset = PRO_WHITE_FIELD_LENGTH_0 + ((entry - PPT_ENTRY_NUM_ORI) << 1);
        PRO_WHITE_FIELD_LENGTH_0_TYPE len0 = {.d16 = RD_PPT_REG(offset)};
        len0.clear_hw_no_tx3 = 1;
        WR_PPT_REG(offset, len0.d16);
    }
}

void ppt_set_auto_ack(uint8_t entry, bool enable)
{
    assert_param(entry < PPT_ENTRY_NUM);
    if (entry == 0)
    {
        WR_PPT_REG_FIELD(PRO_FIELD_LENGTH, auto_no_rdptr_option0, enable);
    }
    else if (entry == 1)
    {
        WR_PPT_REG_FIELD(PRO_TRX_CONTROL, auto_no_rdptr_option1, enable);
    }
    else if (entry == 2)
    {
        WR_PPT_REG_FIELD(PRO_GPIO_CONTROL, auto_no_rdptr_option2, enable);
    }
    else
    {
        uint16_t offset = PRO_FIELD_LENGTH3 + ((entry - PPT_ENTRY_NUM_ORI) << 1);
        PRO_FIELD_LENGTH3_TYPE len3 = {.d16 = RD_PPT_REG(offset)};
        len3.auto_no_rdptr_option3 = enable;
        WR_PPT_REG(offset, len3.d16);
    }
}

PPT_API_SECTION uint8_t ppt_trigger_fw_ack_lock(uint8_t entry, bool lock)
{
    assert_param(entry < PPT_ENTRY_NUM);
    if (ppt_tx_fixed_rptr[entry])
    {
        ppt_tx_fixed_rptr[entry] = false;
        if (entry < PPT_ENTRY_NUM_ORI)
        {
            PRO_PACKET_RELATED_CONTROL0_TYPE pkt_related_ctrl = {.d16 = RD_PPT_REG(PRO_ENTRY_FIELD_BASE(entry) + PRO_PACKET_RELATED_CONTROL0)};
            pkt_related_ctrl.auto_add_rptr_option0 = 0;
            WR_PPT_REG(PRO_ENTRY_FIELD_BASE(entry) + PRO_PACKET_RELATED_CONTROL0,
                       pkt_related_ctrl.d16);
        }
        else
        {
            uint16_t offset = ((entry - PPT_ENTRY_NUM_ORI) << 1) + PRO_FIELD_LENGTH3;
            PRO_FIELD_LENGTH3_TYPE field_len = {.d16 = RD_PPT_REG(offset)};
            field_len.auto_add_rptr_option3 = 0;
            WR_PPT_REG(offset, field_len.d16);
        }
    }
    /* Fw trigger rptr ++ */
#if PPT_LOG_METHOD == 1
    UINT32 cur_bm = RD_U32_BZDMA_REG(BZDMA_REG_BLEONLY_ENTRY_SEGMENT_VALID(entry));
#endif
    if (lock)
    {
        ppt_lock(entry, true);
    }
    if (entry < PPT_ENTRY_NUM_ORI)
    {
        PRO_PACKET_RELATED_CONTROL0_TYPE pkt_related_ctrl = {.d16 = RD_PPT_REG(PRO_ENTRY_FIELD_BASE(entry) + PRO_PACKET_RELATED_CONTROL0)};
        pkt_related_ctrl.fw_ack0 = TRUE; // w1 ack, hw auto pull down in next T
        WR_PPT_REG(PRO_ENTRY_FIELD_BASE(entry) + PRO_PACKET_RELATED_CONTROL0, pkt_related_ctrl.d16);
    }
    else
    {
        uint16_t offset = ((entry - PPT_ENTRY_NUM_ORI) << 1) + PRO_WHITE_FIELD_LENGTH_0;
        PRO_WHITE_FIELD_LENGTH_0_TYPE white_field_len = {.d16 = RD_PPT_REG(offset)};
        white_field_len.fw_ack3 = 0;
        WR_PPT_REG(offset, white_field_len.d16);
    }
    //bzdma_update_fw_rptr_of_ble_data_ring_fifo(entry, 1, FALSE);
    uint8_t rd_ptr = Bzdma_Manager.BleTxEntSta[entry].seg_rptr;
    rd_ptr = (rd_ptr + 1) & (bzdma_supported_le_max_seg_num - 1);
    Bzdma_Manager.BleTxEntSta[entry].seg_rptr = rd_ptr;
    Bzdma_Manager.BleTxEntSta[entry].free_segs += 1;
    if (lock)
    {
        ppt_lock(entry, false);
    }
#if PPT_LOG_METHOD == 1
    APP_PRINT_INFO4("ppt_trigger_fw_ack: BZDMA bitmap 0x%x -> 0x%x, entry %d, rd ptr %d", cur_bm,
                    RD_U32_BZDMA_REG(BZDMA_REG_BLEONLY_ENTRY_SEGMENT_VALID(entry)), entry,
                    rd_ptr);
#endif
    return rd_ptr;
}

