rtkconnectivity/rtl8752h_sdk/src/app/ppt_driver/common/ppt_driver.c
PPT_API_SECTION uint8_t ppt_force_fw_ack(uint8_t entry)
{
    assert_param(entry < PPT_ENTRY_NUM);
    uint8_t rd_ptr = Bzdma_Manager.BleTxEntSta[entry].seg_rptr;
    uint32_t cur_bm = RD_U32_BZDMA_REG(BZDMA_REG_BLEONLY_ENTRY_SEGMENT_VALID(entry));
    uint32_t cur_bm_n = cur_bm & (~(1 << rd_ptr));
    WR_U32_BZDMA_REG(BZDMA_REG_BLEONLY_ENTRY_SEGMENT_VALID(entry), cur_bm_n);

    rd_ptr = (rd_ptr + 1) & (bzdma_supported_le_max_seg_num - 1);
    if (entry < PPT_ENTRY_NUM_ORI)
    {
        PRO_PACKET_RELATED_CONTROL0_TYPE pkt_related_ctrl = {.d16 = RD_PPT_REG(PRO_ENTRY_FIELD_BASE(entry) + PRO_PACKET_RELATED_CONTROL0)};
        pkt_related_ctrl.auto_add_rptr_option0 = 1;
        pkt_related_ctrl.fw_rd_ptr0 = rd_ptr;
        WR_PPT_REG(PRO_ENTRY_FIELD_BASE(entry) + PRO_PACKET_RELATED_CONTROL0, pkt_related_ctrl.d16);
    }
    else
    {
        uint16_t offset = ((entry - PPT_ENTRY_NUM_ORI) << 1) + PRO_FIELD_LENGTH3;
        PRO_FIELD_LENGTH3_TYPE field_len = {.d16 = RD_PPT_REG(offset)};
        field_len.auto_add_rptr_option3 = 1;
        field_len.fw_rd_ptr3 = rd_ptr;
        WR_PPT_REG(offset, field_len.d16);
    }

    Bzdma_Manager.BleTxEntSta[entry].seg_rptr = rd_ptr;
    Bzdma_Manager.BleTxEntSta[entry].free_segs += 1;

    ppt_tx_fixed_rptr[entry] = true;
#if PPT_LOG_METHOD == 1
    APP_PRINT_INFO4("ppt_force_fw_ack: BZDMA bitmap 0x%x -> 0x%x, entry %d, rd ptr %d", cur_bm,
                    RD_U32_BZDMA_REG(BZDMA_REG_BLEONLY_ENTRY_SEGMENT_VALID(entry)), entry,
                    rd_ptr);
#endif
    //pkt_related_ctrl.auto_add_rptr_option0 = 0;
    //WR_PPT_REG(PRO_PACKET_RELATED_CONTROL0, pkt_related_ctrl.d16);
    //bzdma_update_fw_rptr_of_ble_data_ring_fifo(entry, 1, FALSE);
    return rd_ptr;
}

void ppt_flush_rx_fifo(void)
{
    BT_SYS_CTRL_REG_S_TYPE bt_sys_reg;
    bt_sys_reg.d32 = VENDOR_READ(BT_SYS_CTRL_REG);
    bt_sys_reg.b.bt_br_edr_clk_en = 1;
    VENDOR_WRITE(BT_SYS_CTRL_REG, bt_sys_reg.d32);
    BB_write_baseband_register(INSTRUCTION_REGISTER, BB_FLUSH);
    bt_sys_reg.b.bt_br_edr_clk_en = 0;
    VENDOR_WRITE(BT_SYS_CTRL_REG, bt_sys_reg.d32);
}

void ppt_flush_trx_int(void)
{
    while (1)
    {
        PRO_MISR_TYPE reg_misr;
        reg_misr.d16 = RD_PPT_REG(PRO_MISR);
        if (reg_misr.tx_int)
        {
            PRO_TX_LENGTH_TYPE length = {.d16 = RD_PPT_REG(PRO_TX_LENGTH)}; // Read 0x6a to pop stack
        }
        else if (reg_misr.rx_int)
        {
            PRO_RX_HS_UPPER_TYPE rx_hs_upper = {.d16 = RD_PPT_REG(PRO_RX_HS_UPPER)}; //read 0x62 to pop rx stack
        }
        else
        {
            break;
        }
    }
}

void ppt_reset_trx_pkt_num(void)
{
    PRO_CBK_CTRL_TYPE cbk_ctrl = {.d16 = RD_PPT_REG(PRO_CBK_CTRL)};
    cbk_ctrl.reset_rx_pktnum0 = 1;
    cbk_ctrl.reset_rx_pktnum1 = 1;
    cbk_ctrl.reset_tx_pktnum0 = 1;
    cbk_ctrl.reset_tx_pktnum1 = 1;
    WR_PPT_REG(PRO_CBK_CTRL, cbk_ctrl.d16);
    cbk_ctrl.reset_rx_pktnum0 = 0;
    cbk_ctrl.reset_rx_pktnum1 = 0;
    cbk_ctrl.reset_tx_pktnum0 = 0;
    cbk_ctrl.reset_tx_pktnum1 = 0;
    WR_PPT_REG(PRO_CBK_CTRL, cbk_ctrl.d16);

    PRO_WHITE_FIELD_LENGTH_0_TYPE white0 = {.d16 = RD_PPT_REG(PRO_WHITE_FIELD_LENGTH_0)};
    white0.reset_rx_pktnum2 = 1;
    WR_PPT_REG(PRO_WHITE_FIELD_LENGTH_0, white0.d16);
    white0.reset_rx_pktnum2 = 0;
    WR_PPT_REG(PRO_WHITE_FIELD_LENGTH_0, white0.d16);

    for (uint8_t entry = PPT_ENTRY_NUM_ORI; entry < PPT_ENTRY_NUM; entry++)
    {
        uint8_t offset = PRO_WHITE_FIELD_LENGTH_0 + ((entry - PPT_ENTRY_NUM_ORI) << 1);
        PRO_WHITE_FIELD_LENGTH_0_TYPE white0 = {.d16 = RD_PPT_REG(offset)};
        white0.reset_rx_pktnum3 = 1;
        WR_PPT_REG(offset, white0.d16);
        white0.reset_rx_pktnum3 = 0;
        WR_PPT_REG(offset, white0.d16);
    }

    PRO_GPIO_CONTROL_TYPE gpio_ctrl = {.d16 = RD_PPT_REG(PRO_GPIO_CONTROL)};
    gpio_ctrl.reset_tx_pktnum2 = 1;
    WR_PPT_REG(PRO_GPIO_CONTROL, gpio_ctrl.d16);
    gpio_ctrl.reset_tx_pktnum2 = 0;
    WR_PPT_REG(PRO_GPIO_CONTROL, gpio_ctrl.d16);

    for (uint8_t entry = PPT_ENTRY_NUM_ORI; entry < PPT_ENTRY_NUM; entry++)
    {
        uint8_t offset = PRO_FIELD_LENGTH3 + ((entry - PPT_ENTRY_NUM_ORI) << 1);
        PRO_FIELD_LENGTH3_TYPE len3 = {.d16 = RD_PPT_REG(offset)};
        len3.reset_tx_pktnum3 = 1;
        WR_PPT_REG(offset, len3.d16);
        len3.reset_tx_pktnum3 = 0;
        WR_PPT_REG(offset, len3.d16);
    }
}

PPT_API_SECTION void ppt_execute_instruction(uint8_t instruction_code)
{
    if (instruction_code >= PPT_HW_INSTRUCTION_MAX)
    {
#if PPT_LOG_METHOD == 1
        APP_PRINT_ERROR1("ppt_execute_instruction: unknown instruction %d", instruction_code);
#endif
        return;
    }

#if PPT_LOG_METHOD == 1
    APP_PRINT_INFO1("ppt_execute_instruction: execute %d", instruction_code);
#endif
    PRO_INSTRUCTION_TYPE inst;// = {.d16 = RD_PPT_REG(PRO_INSTRUCTION)};
    inst.instruction = instruction_code;
    WR_PPT_REG(PRO_INSTRUCTION, inst.d16);
}

void ppt_set_crc_param(ppt_crc_param_t *param)
{
    PRO_PACKET_CONTROL_TYPE pkt_ctrl = {.d16 = RD_PPT_REG(PRO_PACKET_CONTROL)};
    pkt_ctrl.crc_field_length_2_0 = param->len;
    /* not support feature, shall not be set to true */
    //pkt_ctrl.crc_include_addr_enable = param->include_addr;
    WR_PPT_REG(PRO_PACKET_CONTROL, pkt_ctrl.d16);
}

void ppt_set_crc_entry_param(uint8_t entry, ppt_crc_entry_param_t *param)
{
    assert_param(entry < PPT_ENTRY_NUM);

    /* poly */
    uint16_t crc_poly_lower = param->value.poly & 0xffff;
    uint16_t crc_poly_upper = (param->value.poly >> 16) & 0xffff;
    uint16_t reg_offset_poly = PPT_REG_OFFSET(entry, PRO_CRC_POLYNOMIAL_REG0_LOWER,
                                              PRO_ONE_ENTRY_DW_SIZE, PRO_CRC_POLYNOMIAL_REG3_LOWER, 4);
    WR_PPT_REG(reg_offset_poly, crc_poly_lower);
    WR_PPT_REG(reg_offset_poly + 2, crc_poly_upper);

    /* init tx */
    uint16_t crc_init_lower = param->value.init & 0xffff;
    uint16_t crc_init_upper = (param->value.init >> 16) & 0xffff;
    uint16_t reg_offset_init = PPT_REG_OFFSET(entry, PRO_CRC_INIT0_LOWER, PRO_ONE_ENTRY_DW_SIZE,
                                              PRO_CRC_INIT3_LOWER, 4);
    WR_PPT_REG(reg_offset_init, crc_init_lower);
    WR_PPT_REG(reg_offset_init + 2, crc_init_upper);

    /* init rx */
    uint16_t reg_offset_init_rx = PPT_REG_OFFSET(entry, PRO_RX_CRC_INIT0_LOWER, 4,
                                                 PRO_RX_CRC_INIT3_LOWER, 4);
    WR_PPT_REG(reg_offset_init_rx, crc_init_lower);
    WR_PPT_REG(reg_offset_init_rx + 2, crc_init_upper);
}

void ppt_set_white_param(ppt_white_param_t *param)
{
    PRO_PACKET_CONTROL_TYPE packet_ctrl = {.d16 = RD_PPT_REG(PRO_PACKET_CONTROL)};
    packet_ctrl.white_dis = !param->enable;
    WR_PPT_REG(PRO_PACKET_CONTROL, packet_ctrl.d16);
}

