rtkconnectivity/rtl8752h_sdk/src/app/ppt_driver/common/ppt_driver.c
void ppt_set_white_entry_param(uint8_t entry, ppt_white_entry_param_t *param)
{
    assert_param(entry < PPT_ENTRY_NUM);

    if (entry < PPT_ENTRY_NUM_ORI)
    {
        PRO_PACKET_RELATED_CONTROL0_TYPE pkt_related_ctrl = {.d16 = RD_PPT_REG(PRO_ENTRY_FIELD_BASE(entry) + PRO_PACKET_RELATED_CONTROL0)};
        pkt_related_ctrl.white_field_length0 = param->len;
        WR_PPT_REG(PRO_ENTRY_FIELD_BASE(entry) + PRO_PACKET_RELATED_CONTROL0, pkt_related_ctrl.d16);
    }
    else
    {
        uint16_t offset = ((entry - PPT_ENTRY_NUM_ORI) << 1) + PRO_WHITE_FIELD_LENGTH_0;
        PRO_WHITE_FIELD_LENGTH_0_TYPE white0 = {.d16 = RD_PPT_REG(offset)};
        white0.white_field_length3 = param->len;
        WR_PPT_REG(offset, white0.d16);
    }

    uint16_t white_poly_l = param->value.poly & 0xffff;
    uint16_t white_poly_u = (param->value.poly >> 16) & 0xffff;
    uint16_t reg_offset_poly = PPT_REG_OFFSET(entry, PRO_WHITE_POLYNOMIAL_REG0_LOWER,
                                              PRO_ONE_ENTRY_DW_SIZE, PRO_WHITE_POLYNOMIAL_REG3_LOWER, 4);
    WR_PPT_REG(reg_offset_poly, white_poly_l);
    WR_PPT_REG(reg_offset_poly + 2, white_poly_u);

    uint16_t white_ini_l = param->value.init & 0xffff;
    uint16_t white_ini_u = (param->value.init >> 16) & 0xffff;
    uint16_t reg_offset_init = PPT_REG_OFFSET(entry, PRO_WHITE_INIT0_LOWER, PRO_ONE_ENTRY_DW_SIZE,
                                              PRO_WHITE_INIT3_LOWER, 4);
    WR_PPT_REG(reg_offset_init, white_ini_l);
    WR_PPT_REG(reg_offset_init + 2, white_ini_u);
}

void ppt_set_phy_rx_type(ppt_phy_type_t rx_phy)
{
    PRO_RX_CONTROL_TYPE rx_ctrl = {.d16 = RD_PPT_REG(PRO_RX_CONTROL)};
    rx_ctrl.rx_phy = rx_phy;
    WR_PPT_REG(PRO_RX_CONTROL, rx_ctrl.d16);
}

void ppt_set_phy_tx_type(uint8_t entry, ppt_phy_type_t tx_phy)
{
    assert_param(entry < PPT_ENTRY_NUM);

    if (entry < PPT_ENTRY_NUM_ORI)
    {
        PRO_PACKET_RELATED_CONTROL0_TYPE pkt_related_ctrl = {.d16 = RD_PPT_REG(PRO_ENTRY_FIELD_BASE(entry) + PRO_PACKET_RELATED_CONTROL0)};
        pkt_related_ctrl.tx_phy0 = tx_phy;
        WR_PPT_REG(PRO_ENTRY_FIELD_BASE(entry) + PRO_PACKET_RELATED_CONTROL0, pkt_related_ctrl.d16);
    }
    else
    {
        PRO_WHITE_FIELD_LENGTH_0_TYPE white_field_len = {.d16 = RD_PPT_REG(2 * (entry - PPT_ENTRY_NUM_ORI) + PRO_WHITE_FIELD_LENGTH_0)};
        white_field_len.tx_phy3 = tx_phy;
        WR_PPT_REG(2 * (entry - PPT_ENTRY_NUM_ORI) + PRO_WHITE_FIELD_LENGTH_0, white_field_len.d16);
    }
}

void ppt_set_phy_mod_index_2m(bool change)
{
    if (ppt_fw_ret.mod_index_2m_flag != change)
    {
        if (change)
        {
            RTK_WRITE_MODEM_REG_PI(MODEM_PI_PAGE_7, TRANS_MODEM_REG(0x14), 0xfb34);
            RTK_UPDATE_MODEM_REG_PI(MODEM_PI_PAGE_7, TRANS_MODEM_REG(0x16), 0x3, 0x1);
            RTK_UPDATE_MODEM_REG_PI(MODEM_PI_PAGE_2, TRANS_MODEM_REG(0x14), 0x3f, 0x28);
            RTK_UPDATE_MODEM_REG_PI(MODEM_PI_PAGE_6, TRANS_MODEM_REG(0x2c), 0x3fe, 0x50);
        }
        else
        {
            RTK_WRITE_MODEM_REG_PI(MODEM_PI_PAGE_7, TRANS_MODEM_REG(0x14), 0xffd3);
            RTK_UPDATE_MODEM_REG_PI(MODEM_PI_PAGE_7, TRANS_MODEM_REG(0x16), 0x3, 0x2);
            RTK_UPDATE_MODEM_REG_PI(MODEM_PI_PAGE_2, TRANS_MODEM_REG(0x14), 0x3f, 0x1a);
            RTK_UPDATE_MODEM_REG_PI(MODEM_PI_PAGE_6, TRANS_MODEM_REG(0x2c), 0x3fe, 0x84);
        }
        ppt_fw_ret.mod_index_2m_flag = change;
    }
}

PPT_API_SECTION void ppt_set_phy_bank(uint8_t bank_idx)
{
    /* deprecated */
}

PPT_API_SECTION bool ppt_set_phy_channel(uint16_t freq_mhz)
{
    uint8_t bank = 0, channel = 0;
    if (false == ppt_get_bank_channel(freq_mhz, &bank, &channel))
    {
        return false;
    }
    PRO_CHANNEL_BANK_TYPE ch_bank;
    ch_bank.bank = bank;
    ch_bank.pro_channel = channel;
    WR_PPT_REG(PRO_CHANNEL_BANK, ch_bank.d16);
    /* update phy parameters along with rf bank */
    ppt_set_phy_bank(bank);
    return true;
}

void ppt_set_phy_param(ppt_phy_param_t *param)
{
    PRO_CHANNEL_BANK_TYPE ch_bank = {.d16 = RD_PPT_REG(PRO_CHANNEL_BANK)};
    ch_bank.bank = param->bank;
    ch_bank.pro_channel = param->channel;
    WR_PPT_REG(PRO_CHANNEL_BANK, ch_bank.d16);
    /* update phy parameters along with rf bank */
    ppt_set_phy_bank(param->bank);

    ppt_set_phy_rx_type(param->rx_phy);
}

void ppt_set_phy_entry_param(uint8_t entry, ppt_phy_entry_param_t *param)
{
    assert_param(entry < PPT_ENTRY_NUM);

    ppt_set_phy_tx_type(entry, param->tx_phy);
    ppt_set_preamble_len(entry, param->preamble_len);
}

void ppt_set_preamble_len(uint8_t entry, uint8_t preamble_len)
{
    assert_param(entry < PPT_ENTRY_NUM);

    if (entry == 0)
    {
        PRO_FIELD_LENGTH_TYPE field_len = {.d16 = RD_PPT_REG(PRO_FIELD_LENGTH)};
        field_len.preamble_field_length0_2_0 = preamble_len;
        WR_PPT_REG(PRO_FIELD_LENGTH, field_len.d16);
    }
    else if (entry == 1)
    {
        PRO_FIELD_LENGTH2_TYPE field_len2 = {.d16 = RD_PPT_REG(PRO_FIELD_LENGTH2)};
        field_len2.preamble_field_length1_2_0 = preamble_len;
        WR_PPT_REG(PRO_FIELD_LENGTH2, field_len2.d16);
    }
    else if (entry == 2)
    {
        PRO_GPIO_CONTROL_TYPE gpio_ctrl = {.d16 = RD_PPT_REG(PRO_GPIO_CONTROL)};
        gpio_ctrl.preamble_field_length2 = preamble_len;
        WR_PPT_REG(PRO_GPIO_CONTROL, gpio_ctrl.d16);
    }
    else
    {
        PRO_FIELD_LENGTH3_TYPE field_len = {.d16 = RD_PPT_REG(2 * (entry - PPT_ENTRY_NUM_ORI) + PRO_FIELD_LENGTH3)};
        field_len.preamble_field_length3_2_0 = preamble_len;
        WR_PPT_REG(2 * (entry - PPT_ENTRY_NUM_ORI) + PRO_FIELD_LENGTH3, field_len.d16);
    }
}

void ppt_set_pkt_format(ppt_pkt_format_t *param)
{
    PRO_RX_MATCH_CONTROL_TYPE rx_match_ctrl = {.d16 = RD_PPT_REG(PRO_RX_MATCH_CONTROL)};
    rx_match_ctrl.compare_prefix_option = param->addr_len == 5;
    WR_PPT_REG(PRO_RX_MATCH_CONTROL, rx_match_ctrl.d16);

    PRO_FIELD_LENGTH_TYPE field_len = {.d16 = RD_PPT_REG(PRO_FIELD_LENGTH)};
    field_len.address_field_length_2_0 = param->addr_len;
    field_len.hp_field_length_3_0 = param->hp_len;
    field_len.length_field_length_3_0 = param->length_len;
    WR_PPT_REG(PRO_FIELD_LENGTH, field_len.d16);

    PRO_HS_LENGTH_TYPE hs_len = {.d16 = RD_PPT_REG(PRO_HS_LENGTH)};
    hs_len.hs_field_length_4_0 = param->hs_len;
    WR_PPT_REG(PRO_HS_LENGTH, hs_len.d16);

    PRO_ORDER_CONTROL_TYPE order_ctrl = {.d16 = RD_PPT_REG(PRO_ORDER_CONTROL)};
    order_ctrl.hp_order = param->header_order;
    order_ctrl.hp_order_first = param->header_order;
    order_ctrl.length_order = param->header_order;
    order_ctrl.length_order_first = param->header_order;
    order_ctrl.hs_order = param->header_order;
    order_ctrl.hs_order_first = param->header_order;
    WR_PPT_REG(PRO_ORDER_CONTROL, order_ctrl.d16);
    WR_PPT_REG_FIELD(PRO_MAX_LENGTH, txfifo_out_split,
                     param->payload_order == PPT_FIELD_BIT_ORDER_MSB ? 1 : 0);
    WR_PPT_REG_FIELD(PRO_MAX_LENGTH, rxfifo_in_split,
                     param->payload_order == PPT_FIELD_BIT_ORDER_MSB ? 1 : 0);

