rtkconnectivity/rtl8752h_sdk/src/app/ppt_driver/common/ppt_driver.c
    PRO_PREFIX6_7_TYPE prefix6_7 = {.d16 = RD_PPT_REG(PRO_PREFIX6_7)};
    prefix6_7.hp_order_first_rx = param->header_order;
    prefix6_7.length_order_first_rx = param->header_order;
    prefix6_7.hs_order_first_rx = param->header_order;
    WR_PPT_REG(PRO_PREFIX6_7, prefix6_7.d16);
}

void ppt_set_addon_len(uint8_t entry, ppt_addon_length_t *param)
{
    assert_param(entry < PPT_ENTRY_NUM);

    if (entry < PPT_ENTRY_NUM_ORI)
    {
        PRO_ADD_ON_LENGTH0_TYPE add_on_length = {.d16 = RD_PPT_REG(PRO_ENTRY_FIELD_BASE(entry) + PRO_ADD_ON_LENGTH0)};
        add_on_length.add_on_length0_7_0 = param->len;
        WR_PPT_REG(PRO_ENTRY_FIELD_BASE(entry) + PRO_ADD_ON_LENGTH0, add_on_length.d16);
    }
    else
    {
        uint16_t offset = ((entry - PPT_ENTRY_NUM_ORI) & (~BIT0)) + PRO_ADD_ON_LENGTH3;
        uint8_t field_offset = ((entry - PPT_ENTRY_NUM_ORI) & BIT0) << 3;
        OV_PPT_REG_FIELD(offset, field_offset, 8, param->len);
    }
}

void ppt_set_tx_power(uint8_t tx_gain)
{
    PRO_GAIN_TYPE gain = {.d16 = RD_PPT_REG(PRO_GAIN)};
    gain.rif_tx_gain = tx_gain;
    WR_PPT_REG(PRO_GAIN, gain.d16);
}

extern bool (*get_valid_txgain_index_from_tx_power)(int8_t, uint8_t, uint8_t, bool, uint8_t *,
                                                    int8_t *);
#define TXGAIN_LE_1M    0
#define TPM_MODE        0
void ppt_set_tx_power_dbm(float tx_power_dbm)
{
    uint8_t tx_gain;
    int8_t tx_power = tx_power_dbm;
    int8_t tx_power_act;
    //todo: set according to phy
    get_valid_txgain_index_from_tx_power(tx_power * 2, TXGAIN_LE_1M, TPM_MODE, TRUE, &tx_gain,
                                         &tx_power_act);
    ppt_set_tx_power(tx_gain);
}

void ppt_set_tx_addr(uint8_t entry, ppt_tx_addr_t *param)
{
    assert_param(entry < PPT_ENTRY_NUM);

    uint16_t tx_addr;
    tx_addr = param->tx_addr[0] | (param->tx_addr[1] << 8);
    WR_PPT_REG(ppt_lut_tx_addr[entry], tx_addr);

    tx_addr = param->tx_addr[2] | (param->tx_addr[3] << 8);
    WR_PPT_REG(ppt_lut_tx_addr[entry] + 2, tx_addr);

    OV_PPT_REG_FIELD(ppt_lut_tx_addr[entry] + 4, 0, 8, param->tx_addr[4]);
}

void ppt_check_rx_addr(uint8_t bit_th)
{
    PRO_RX_CONTROL_TYPE rx_ctrl = {.d16 = RD_PPT_REG(PRO_RX_CONTROL)};
    PRO_RX_MATCH_CONTROL_TYPE rx_match_ctrl = {.d16 = RD_PPT_REG(PRO_RX_MATCH_CONTROL)};
    uint32_t rx_addr0, rx_addr1;
    bool byte3_flag = false;
    bool similar_flag = false;
    if ((rx_match_ctrl.rx_match_enable_bit_7_0 & 0x1) == 0x1)
    {
        rx_addr0 = RD_PPT_REG(PRO_BASE0_LOWER) + (RD_PPT_REG(PRO_BASE0_UPPER) << 16);
        if ((rx_addr0 >> 24) == 0xff)
        {
            byte3_flag = true;
        }
    }
    if ((rx_match_ctrl.rx_match_enable_bit_7_0 & 0x2) == 0x2)
    {
        rx_addr1 = RD_PPT_REG(PRO_BASE1_LOWER) + (RD_PPT_REG(PRO_BASE1_UPPER) << 16);
        if ((rx_addr1 >> 24) == 0xff)
        {
            byte3_flag = true;
        }
    }

    uint8_t acc_byte3_flag = byte3_flag ? (rx_ctrl.rx_phy == PPT_PHY_TYPE_BLE_2M ? 2 : 1) : 0;
    if (acc_byte3_flag != ppt_fw_ret.acc_byte3_flag)
    {
        /* default value */
        if (ppt_fw_ret.acc_byte3_flag == 2) /* 2M PHY */
        {
            RTK_UPDATE_MODEM_REG_PI(MODEM_PI_PAGE_0, TRANS_MODEM_REG(0x10), 0x1 << 3, 0x1 << 3);
        }
        else if (ppt_fw_ret.acc_byte3_flag == 1)/* 1M PHY */
        {
            RTK_UPDATE_MODEM_REG_PI(MODEM_PI_PAGE_2, TRANS_MODEM_REG(0x68), 0x7 << 9, 0x4 << 9);
        }

        /* modified value */
        if (acc_byte3_flag == 2)/* 2M PHY */
        {
            /* need restore after dlps */
            RTK_UPDATE_MODEM_REG_PI(MODEM_PI_PAGE_0, TRANS_MODEM_REG(0x10), 0x1 << 3, 0x0 << 3);
        }
        else if (acc_byte3_flag == 1)/* 1M PHY */
        {
            /* need restore after dlps */
            RTK_UPDATE_MODEM_REG_PI(MODEM_PI_PAGE_2, TRANS_MODEM_REG(0x68), 0x7 << 9, 0x1 << 9);
        }

        ppt_fw_ret.acc_byte3_flag = acc_byte3_flag;
    }

    if ((rx_match_ctrl.rx_match_enable_bit_7_0 & 0x3) == 0x3)
    {
        uint32_t addr_diff = rx_addr0 ^ rx_addr1;
        uint8_t diff_count = 0;
        while (addr_diff)
        {
            diff_count += 1;
            addr_diff &= addr_diff - 1;
        }
        if (diff_count <= bit_th)
        {
            similar_flag = true;
        }
    }

    if (similar_flag != ppt_fw_ret.acc_similar_flag)
    {
        ppt_fw_ret.acc_similar_flag = similar_flag;
        if (similar_flag) /* modified value */
        {
            /* need restore after dlps */
            RTK_UPDATE_MODEM_REG_PI(MODEM_PI_PAGE_6, TRANS_MODEM_REG(0x4a), 0xff << 0, 0x33 << 0);
            /* 1M PHY */
            {
                RTK_UPDATE_MODEM_REG_PI(MODEM_PI_PAGE_0, TRANS_MODEM_REG(0x3C), 0x1 << 11, 0x1 << 11);
                /* need restore after dlps */
                RTK_UPDATE_MODEM_REG_PI(MODEM_PI_PAGE_0, TRANS_MODEM_REG(0x2C), 0x7 << 13, 0x0 << 13);
            }
            /* 2M PHY */
            {
                RTK_UPDATE_MODEM_REG_PI(MODEM_PI_PAGE_6, TRANS_MODEM_REG(0x2a), 0x1 << 3, 0x1 << 3);
                RTK_UPDATE_MODEM_REG_PI(MODEM_PI_PAGE_6, TRANS_MODEM_REG(0x2a), 0x7 << 4, 0x0 << 4);
            }
        }
        else /* default value */
        {
            RTK_UPDATE_MODEM_REG_PI(MODEM_PI_PAGE_6, TRANS_MODEM_REG(0x4a), 0xff << 0, 0xcc << 0);
            /* 1M PHY */
            {
                RTK_UPDATE_MODEM_REG_PI(MODEM_PI_PAGE_0, TRANS_MODEM_REG(0x3C), 0x1 << 11, 0x0 << 11);
                RTK_UPDATE_MODEM_REG_PI(MODEM_PI_PAGE_0, TRANS_MODEM_REG(0x2C), 0x7 << 13, 0x2 << 13);
            }
            /* 2M PHY */
            {
                RTK_UPDATE_MODEM_REG_PI(MODEM_PI_PAGE_6, TRANS_MODEM_REG(0x2a), 0x1 << 3, 0x0 << 3);
                RTK_UPDATE_MODEM_REG_PI(MODEM_PI_PAGE_6, TRANS_MODEM_REG(0x2a), 0x7 << 4, 0x6 << 4);
            }
        }
    }
}

#define ppt_set_prefix(entry, prefix) OV_PPT_REG_FIELD(ppt_lut_prefix[entry].reg_offset, ppt_lut_prefix[entry].field_offset, 8, prefix)

void ppt_set_rx_addr(uint8_t entry, ppt_rx_addr_t *param)
{
    assert_param(entry < PPT_ENTRY_RX_NUM);
    PRO_RX_MATCH_CONTROL_TYPE rx_match_ctrl = {.d16 = RD_PPT_REG(PRO_RX_MATCH_CONTROL)};
    if (param->enable)
    {
        rx_match_ctrl.rx_match_enable_bit_7_0 |= BIT(entry);
        ppt_fw_ret.modem_acc_enable |= BIT(entry);
        uint16_t addr = param->rx_addr[0] + (param->rx_addr[1] << 8);
        uint16_t addr1 = param->rx_addr[2] + (param->rx_addr[3] << 8);
        uint8_t prefix = param->rx_addr[4];
        uint32_t base_for_modem = ppt_swap_bits32(addr + (addr1 << 16));
        ppt_fw_ret.modem_acc[entry] = base_for_modem;
        if (entry == 0)
        {
            WR_PPT_REG(PRO_BASE0_LOWER, addr);
            WR_PPT_REG(PRO_BASE0_UPPER, addr1);
            RTK_WRITE_MODEM_REG_PI(MODEM_PI_PAGE_0, TRANS_MODEM_REG(0x1c), base_for_modem);
            RTK_WRITE_MODEM_REG_PI(MODEM_PI_PAGE_0, TRANS_MODEM_REG(0x1e), base_for_modem >> 16);
        }
        else
        {
            WR_PPT_REG(PRO_BASE1_LOWER, addr);
            WR_PPT_REG(PRO_BASE1_UPPER, addr1);
            RTK_WRITE_MODEM_REG_PI(MODEM_PI_PAGE_0, TRANS_MODEM_REG(0x24), base_for_modem);
            RTK_WRITE_MODEM_REG_PI(MODEM_PI_PAGE_0, TRANS_MODEM_REG(0x26), base_for_modem >> 16);
            // Set Bit0 to 1 if use 2 rx match filter
            RTK_UPDATE_MODEM_REG_PI(MODEM_PI_PAGE_0, TRANS_MODEM_REG(0x14), BIT0, 1);
            WR_PPT_REG_FIELD(PRO_TX_PKT_NUM2, modem_compare2_addr, 1);
            // disable acc false alarm protect scheme
            //RTK_UPDATE_MODEM_REG_PI(MODEM_PI_PAGE_6, TRANS_MODEM_REG(0x56), 0x3, 0);
        }
        ppt_set_prefix(entry, prefix);
    }
    else
    {
        rx_match_ctrl.rx_match_enable_bit_7_0 &= ~BIT(entry);
        ppt_fw_ret.modem_acc_enable &= ~BIT(entry);
        if (entry >= 1 && (ppt_fw_ret.modem_acc_enable & 0xfe) == 0)
        {
            RTK_UPDATE_MODEM_REG_PI(MODEM_PI_PAGE_0, TRANS_MODEM_REG(0x14), BIT0, 0);
            WR_PPT_REG_FIELD(PRO_TX_PKT_NUM2, modem_compare2_addr, 0);
            RTK_UPDATE_MODEM_REG_PI(MODEM_PI_PAGE_6, TRANS_MODEM_REG(0x56), 0x3, 0x3);
        }
    }
    WR_PPT_REG(PRO_RX_MATCH_CONTROL, rx_match_ctrl.d16);
}

