rtkconnectivity/rtl8752h_sdk/src/app/ppt_driver/common/ppt_driver.c
PPT_API_SECTION void ppt_set_hp(uint8_t entry, uint8_t hp)
{
    assert_param(entry < PPT_ENTRY_NUM);

    if (entry < PPT_ENTRY_NUM_ORI)
    {
        PRO_HP_0_TYPE hp0 = {.d16 = RD_PPT_REG(PRO_HP_0 + PRO_ENTRY_FIELD_BASE(entry))};
        hp0.hp_0_7_0 = hp;
        WR_PPT_REG(PRO_HP_0 + PRO_ENTRY_FIELD_BASE(entry), hp0.d16);
    }
    else
    {
        uint16_t reg_offet = PRO_HP_3 + (((entry - PPT_ENTRY_NUM_ORI) >> 1) << 1);
        uint8_t field_offset = ((entry - PPT_ENTRY_NUM_ORI) & 0x1) << 3;
        OV_PPT_REG_FIELD(reg_offet, field_offset, 8, hp);
    }
}

PPT_API_SECTION void ppt_set_length(uint8_t entry, uint16_t length)
{
    assert_param(entry < PPT_ENTRY_NUM);

    if (entry < PPT_ENTRY_NUM_ORI)
    {
        PRO_LENGTH_0_TYPE len = {.d16 = RD_PPT_REG(PRO_LENGTH_0 + PRO_ENTRY_FIELD_BASE(entry))};
        len.length_0_14_0 = length;
        WR_PPT_REG(PRO_LENGTH_0 + PRO_ENTRY_FIELD_BASE(entry), len.d16);
    }
    else
    {
        uint16_t offset = ((entry - PPT_ENTRY_NUM_ORI) << 1) + PRO_LENGTH_3;
        PRO_LENGTH_3_TYPE len = {.d16 = RD_PPT_REG(offset)};
        len.length_3_14_0 = length;
        WR_PPT_REG(offset, len.d16);
    }
}

PPT_API_SECTION void ppt_set_hs(uint8_t entry, uint32_t hs)
{
    assert_param(entry < PPT_ENTRY_NUM);

    uint16_t reg_offet_l = PPT_REG_OFFSET(entry, PRO_HS_0_LOWER, PRO_ONE_ENTRY_DW_SIZE, PRO_HS_3_LOWER,
                                          4);
    WR_PPT_REG(reg_offet_l, hs & 0xffff);
    OV_PPT_REG_FIELD(reg_offet_l + 2, 1, 15, (hs >> 16) & 0xffff);
}

void ppt_set_tx_header(uint8_t entry, ppt_header_t *param)
{
    assert_param(entry < PPT_ENTRY_NUM);

    ppt_set_hp(entry, param->hp);
    /* length not used if dma_length_mode is enabled */
    ppt_set_length(entry, param->length);
    ppt_set_hs(entry, param->hs);
}

void ppt_set_tifs(uint8_t tifs_us)
{
    PRO_TX_TURN_AROUND_DELAY_TYPE tx_delay = {.d16 = RD_PPT_REG(PRO_TX_TURN_AROUND_DELAY)};
    tx_delay.pro_tx2rx_delay_base = tifs_us - 22;
    WR_PPT_REG(PRO_TX_TURN_AROUND_DELAY, tx_delay.d16);
    PRO_RX_TURN_AROUND_DELAY_TYPE rx_delay = {.d16 = RD_PPT_REG(PRO_RX_TURN_AROUND_DELAY)};
    rx_delay.pro_rx2tx_delay_base = tifs_us - 20;
    WR_PPT_REG(PRO_RX_TURN_AROUND_DELAY, rx_delay.d16);
}

void ppt_set_timing_latch(ppt_timing_latch_t *param)
{
    PRO_CBK_CTRL_TYPE cbk_ctrl = {.d16 = RD_PPT_REG(PRO_CBK_CTRL)};
    cbk_ctrl.tx_time_enable = param->tx_on;
    WR_PPT_REG(PRO_CBK_CTRL, cbk_ctrl.d16);

    PRO_RX_CONTROL_TYPE rx_ctrl = {.d16 = RD_PPT_REG(PRO_RX_CONTROL)};
    rx_ctrl.acchit_time_enable = param->acc_hit;
    WR_PPT_REG(PRO_RX_CONTROL, rx_ctrl.d16);
}

void ppt_set_gpio_param(ppt_gpio_param_t *param)
{
    PRO_RESET_CTRL_REG_TYPE reset_ctrl = {.d16 = RD_PPT_REG(PRO_RESET_CTRL_REG)};
    reset_ctrl.gpio_tx_enable = param->enable;
    reset_ctrl.gpio_in_enable = param->int_enable;
    WR_PPT_REG(PRO_RESET_CTRL_REG, reset_ctrl.d16);
}

void ppt_set_gpio_entry_param(uint8_t entry, ppt_gpio_entry_param_t *param)
{
    assert_param(entry < PPT_ENTRY_NUM);

    if (entry == 0)
    {
        PRO_GPIO_TX_DELAY_TYPE gpio_tx_delay = {.d16 = RD_PPT_REG(PRO_GPIO_TX_DELAY)};
        gpio_tx_delay.gpio_tx_delay_15_0 = param->gpio_delay;
        WR_PPT_REG(PRO_GPIO_TX_DELAY, gpio_tx_delay.d16);
    }
    else if (entry == 1)
    {
        PRO_GPIO_TX_DELAY1_TYPE gpio_tx_delay1 = {.d16 = RD_PPT_REG(PRO_GPIO_TX_DELAY1)};
        gpio_tx_delay1.gpio_tx_delay1_15_0 = param->gpio_delay;
        WR_PPT_REG(PRO_GPIO_TX_DELAY1, gpio_tx_delay1.d16);
    }
    else if (entry == 2)
    {
        PRO_GPIO_TX_DELAY2_TYPE gpio_tx_delay2 = {.d16 = RD_PPT_REG(PRO_GPIO_TX_DELAY2)};
        gpio_tx_delay2.gpio_tx_delay2_15_0 = param->gpio_delay;
        WR_PPT_REG(PRO_GPIO_TX_DELAY2, gpio_tx_delay2.d16);
    }
    else
    {
        /* no setting here */
    }
}

void ppt_set_ptx_mode(ppt_ptx_mode_t *param)
{
    PRO_TX_CONTROL_TYPE tx_ctrl = {.d16 = RD_PPT_REG(PRO_TX_CONTROL)};
    tx_ctrl.periodic_enable = param->periodic_mode;
    WR_PPT_REG(PRO_TX_CONTROL, tx_ctrl.d16);

    PRO_TRX_CONTROL_TYPE trx_ctrl = {.d16 = RD_PPT_REG(PRO_TRX_CONTROL)};
    trx_ctrl.ack_enable = param->ack_mode;
    WR_PPT_REG(PRO_TRX_CONTROL, trx_ctrl.d16);

    if (param->periodic_mode)
    {
        PRO_PERIODIC_INTERVAL_TYPE periodic_interval;
        periodic_interval.d16 = param->periodic_interval;
        WR_PPT_REG(PRO_PERIODIC_INTERVAL, periodic_interval.d16);
        PRO_TRX_CONTROL_TYPE trx_ctrl = {.d16 = RD_PPT_REG(PRO_TRX_CONTROL)};
        trx_ctrl.periodic_interval_19_16 = param->periodic_interval >> 16;
        WR_PPT_REG(PRO_TRX_CONTROL, trx_ctrl.d16);
    }
}

void ppt_set_prx_mode(ppt_prx_mode_t *param)
{
    PRO_RX_CONTROL_TYPE rx_ctrl = {.d16 = RD_PPT_REG(PRO_RX_CONTROL)};
    rx_ctrl.continuous_rx = param->continuous_mode;
    WR_PPT_REG(PRO_RX_CONTROL, rx_ctrl.d16);

    PRO_TRX_CONTROL_TYPE trx_ctrl = {.d16 = RD_PPT_REG(PRO_TRX_CONTROL)};
    trx_ctrl.ack_enable = param->ack_mode;
    WR_PPT_REG(PRO_TRX_CONTROL, trx_ctrl.d16);
}

void ppt_set_psd_mode(ppt_psd_mode_t *param)
{
    assert_param(param->chann_start <= param->chann_stop);
    assert_param(param->chann_stop < PSD_CHANN_NUM);
    assert_param(param->chann_step < PSD_CHANN_NUM);

    PRO_PSD_RANGE0_TYPE psd_range0 = {.d16 = RD_PPT_REG(PRO_PSD_RANGE0)};
    psd_range0.pro_psd_start = param->chann_start;
    psd_range0.pro_psd_end = param->chann_stop;
    WR_PPT_REG(PRO_PSD_RANGE0, psd_range0.d16);

    PRO_PSD_RANGE1_TYPE psd_range1 = {.d16 = RD_PPT_REG(PRO_PSD_RANGE1)};
    psd_range1.pro_psd_step = param->chann_step;
    psd_range1.pro_psd_mode = param->mode;
    WR_PPT_REG(PRO_PSD_RANGE1, psd_range1.d16);

    PRO_PSD_TIMEOUT_TYPE psd_timeout = {.d16 = RD_PPT_REG(PRO_PSD_TIMEOUT)};
    psd_timeout.pro_psd_timeout = param->timeout;
    WR_PPT_REG(PRO_PSD_TIMEOUT, psd_timeout.d16);
}

#define DIGI_DBG_BT     1
#define DBG_PIN_GROUP_A 0
extern void (*debug_port_open)(uint8_t debug_mode);
extern void (*debug_port_set_pin_bit_map)(uint8_t pin_group, uint32_t dbg_bitmap);

void ppt_dbg_port_open(uint16_t bt_port, uint16_t ppt_port, uint16_t ppt_port2)
{
    /* baseband port */
    VENDOR_WRITE(0x30, (VENDOR_READ(0x30)&BIT31) | 0x40);
    WR_16BIT_IO(BB_BASE_ADDR, 0x1FE, bt_port);

