rtkconnectivity/rtl8752h_sdk/src/app/ppt_driver/common/ppt_driver.c
    /* 2.4g port */
    WR_PPT_REG(PRO_DEBUG_SEL, ppt_port);
    WR_PPT_REG(PRO_DEBUG_SEL2, ppt_port2);

    /* sys */
    debug_port_open(DIGI_DBG_BT);
}

void ppt_dbg_port_set_pin(uint8_t pin_group, uint32_t dbg_bitmap)
{
#if PPT_IS_ASIC
    debug_port_set_pin_bit_map(pin_group, dbg_bitmap);
#endif
}

void ppt_dbg_port(uint16_t bt_port, uint16_t ppt_port, uint16_t ppt_port2, uint32_t dbg_bitmap)
{
    ppt_dbg_port_set_pin(DBG_PIN_GROUP_A, dbg_bitmap);
    ppt_dbg_port_open(bt_port, ppt_port, ppt_port2);
}

void ppt_dump_nonzero_reg(void)
{
    DBG_DIRECT("ppt_dump_nonzero_reg: start");
    uint16_t offset = 0;
    while (offset < PRO_REG_TOTAL_SIZE)
    {
        uint16_t value = RD_PPT_REG(offset);
        if (value != 0)
        {
            DBG_DIRECT("ppt_dump_nonzero_reg: 0x%04x = 0x%04x", offset, value);
        }
        offset += 2;
    }
    DBG_DIRECT("ppt_dump_nonzero_reg: end");
}

bool ppt_get_bank_channel(uint16_t frequency, uint8_t *bank, uint8_t *channel)
{
    if (frequency > 2530)
    {
        return false;
    }
    else if (frequency > 2480)
    {
        *bank = 2;
        *channel = frequency - 2452;
    }
    else if (frequency >= 2402)
    {
        *bank = 0;
        *channel = frequency - 2402;
    }
    else if (frequency >= 2348)
    {
        *bank = 1;
        *channel = frequency - 2348;
    }
    else
    {
        return false;
    }
    return true;
}

static const uint8_t le_logic_chan[40] =
{
    37, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 38, 11, 12, 13, 14, 15, 16, 17, 18, 19,
    20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 39
};

int8_t ppt_get_ble_logic_chan(uint8_t bank, uint8_t channel)
{
    if (bank == 0 && (channel & 0x1) == 0 && channel <= 78)
    {
        return le_logic_chan[channel / 2];
    }
    else
    {
        return -1;
    }
}

int8_t ppt_get_ble_logic_chan_via_freq(uint16_t frequency)
{
    if (frequency >= 2402 && frequency <= 2480 && ((frequency & 0x1) == 0))
    {
        return le_logic_chan[(frequency - 2402) / 2];
    }
    else
    {
        return -1;
    }
}

uint32_t ppt_get_ble_white_init(uint8_t le_logic_chan)
{
    uint32_t white_init = 1;
    le_logic_chan = ppt_swap_bits8(le_logic_chan);
    white_init |= le_logic_chan >> 1;
    return white_init;
}

#if PATCH_BTMAC_ISR
PPT_ISR_SECTION static uint8_t btmac_isr_handler(void *pbuf)
#else
PPT_ISR_SECTION static void btmac_isr_handler(void)
#endif
{
    BTMAC_ISR_STATUS_REG reg = btmac_isr_status_reg_read();
    //APP_PRINT_INFO1("btmac_isr_handler 0x%08x!", reg.d32);
    if (reg.pro_intr_r)
    {
        if (ppt_isr_handler)
        {
            ppt_isr_handler();
        }
        else
        {
            DBG_DIRECT("ppt: fail, ISR isn't registered!");
        }
    }
#if PATCH_BTMAC_ISR
    return false;
#endif
}

PPT_ISR_SECTION static uint8_t btmac_psd_isr_handler(void *buf)
{
    ppt_clear_radio();
    if (ppt_psd_isr_handler)
    {
        ppt_psd_isr_handler();
    }

    return true;
}

PPT_API_SECTION bool ppt_push_tx_fifo(uint8_t entry, uint8_t *payload, uint16_t payload_len)
{
    bool ret;
    assert_param(entry < PPT_ENTRY_NUM);
    uint32_t s = os_lock();
#if PPT_LOG_METHOD == 1
    UINT32 cur_bm = RD_U32_BZDMA_REG(BZDMA_REG_BLEONLY_ENTRY_SEGMENT_VALID(entry));
#endif
    /* config bzdma */
    BZDMA_BLEONLY_TX_DESC_FRAGMENT TxFragCache = { .DWord = 0 };
    TxFragCache.start_addr_ex = (UINT32)payload;
    TxFragCache.len_ex = payload_len;
    TxFragCache.isLast = TRUE;
    ret = bzdma_send_packet_to_ble_data_ring_fifo(entry, LL_LLID_DATA_PDU_START,
                                                  &TxFragCache, 1, 0);
    ret = true;
#if PPT_LOG_METHOD == 1
    APP_PRINT_INFO5("ppt_push_tx_fifo: BZDMA bitmap 0x%x -> 0x%x, entry %d, wr ptr %d, len %d", cur_bm,
                    RD_U32_BZDMA_REG(BZDMA_REG_BLEONLY_ENTRY_SEGMENT_VALID(entry)), entry,
                    Bzdma_Manager.BleTxEntSta[entry].seg_wptr, payload_len);
#endif
    os_unlock(s);
    return ret;
}

PPT_API_SECTION static UINT8 bzdma_update_packet_to_ble_data_ring_fifo(UINT8 conn_entry, UINT8 llid,
                                                                       BZDMA_BLEONLY_TX_DESC_FRAGMENT *pfrag, UINT8 Nfrag,
                                                                       UINT8 codeind)
{
    BZDMA_BLEONLY_DATA_TX_DESC_ENTRY_STATUS *pTxEnt;
    BZDMA_BLEONLY_TX_DESC_SEGMENT *pTxSeg;
    BZDMA_BLEONLY_TX_DESC_FRAGMENT *pTxFrag;
    UINT8 cur_wptr;
    UINT8 i;
    UINT8 PktSize = 0;

    pTxEnt = &Bzdma_Manager.BleTxEntSta[conn_entry];
    if (pTxEnt->free_segs == bzdma_supported_le_max_seg_num)
    {
        /* fifo is empty */
        return FALSE;
    }

    cur_wptr = (pTxEnt->seg_wptr + bzdma_supported_le_max_seg_num - 1) & (bzdma_supported_le_max_seg_num
                                                                          - 1);
    pTxSeg = &pTxEnt->pTxSegDesc[cur_wptr];
    pTxFrag = &pTxEnt->pTxFragDesc[cur_wptr * 2];

    /* fill all fragments */
    for (i = 0; i < Nfrag; i++)
    {
        pTxFrag[i].DWord = pfrag[i].DWord;
        UINT16 local_len;
        local_len = pfrag[i].len_ex;
        PktSize +=  local_len;
        if (local_len == 0)
        {
            /* hw can not handle zero length !! */
            return FALSE;
        }
    }

    /* fill full packet sie to tx segment */
    pTxSeg->len = PktSize;
    pTxSeg->llid = llid;
    return TRUE;
}

PPT_API_SECTION bool ppt_update_tx_fifo(uint8_t entry, uint8_t *payload, uint16_t payload_len)
{
    bool ret;
    assert_param(entry < PPT_ENTRY_NUM);
    uint32_t s = os_lock();
#if PPT_LOG_METHOD == 1
    UINT32 cur_bm = RD_U32_BZDMA_REG(BZDMA_REG_BLEONLY_ENTRY_SEGMENT_VALID(entry));
#endif
    /* config bzdma */
    BZDMA_BLEONLY_TX_DESC_FRAGMENT TxFragCache = { .DWord = 0 };
    TxFragCache.start_addr_ex = (UINT32)payload;
    TxFragCache.len_ex = payload_len;
    TxFragCache.isLast = TRUE;
    ret = bzdma_update_packet_to_ble_data_ring_fifo(entry, LL_LLID_DATA_PDU_START,
                                                    &TxFragCache, 1, 0);
    ret = true;
#if PPT_LOG_METHOD == 1
    APP_PRINT_INFO5("ppt_update_tx_fifo: BZDMA bitmap 0x%x -> 0x%x, entry %d, wr ptr %d, len %d",
                    cur_bm,
                    RD_U32_BZDMA_REG(BZDMA_REG_BLEONLY_ENTRY_SEGMENT_VALID(entry)), entry,
                    Bzdma_Manager.BleTxEntSta[entry].seg_wptr, payload_len);
#endif
    os_unlock(s);
    return ret;
}

