rtkconnectivity/rtl8752h_sdk/src/app/ppt_driver/common/ppt_driver.c
PPT_API_SECTION bool ppt_pop_rx_fifo_wait_done(void)
{
    bzdma_wait_rxcmd_complete();
    return true;
}

PPT_API_SECTION bool ppt_pop_rx_fifo_with_wait_option(uint8_t entry, uint8_t *pdu, uint16_t pdu_len,
                                                      bool wait)
{
    assert_param(entry < PPT_ENTRY_NUM);

    /* config bzdma */
    BZDMA_RX_DESC_SEGMENT rxdesc = { .DWord = 0 };
    rxdesc.addr = (uint32_t)pdu;
    rxdesc.len = pdu_len;
    rxdesc.flush = FALSE;
    bzdma_send_burst_rxcmd_and_wait_complete(&rxdesc, 1,
                                             BZDMA_RX_PID_ACL, entry, wait);
    return true;
}

PPT_API_SECTION bool ppt_pop_rx_fifo(uint8_t entry, uint8_t *pdu, uint16_t pdu_len)
{
    return ppt_pop_rx_fifo_with_wait_option(entry, pdu, pdu_len, TRUE);
}

uint8_t ppt_flush_tx_fifo(uint8_t entry)
{
    assert_param(entry < PPT_ENTRY_NUM);

    Bzdma_Manager.BleTxEntSta[entry].seg_wptr = Bzdma_Manager.BleTxEntSta[entry].seg_rptr;
    Bzdma_Manager.BleTxEntSta[entry].free_segs = bzdma_supported_le_max_seg_num;
    bzdma_ble_set_segment_valid_bitmap(entry, 0);
    return Bzdma_Manager.BleTxEntSta[entry].seg_rptr;
}

PPT_API_SECTION uint8_t ppt_get_tx_fifo_rdptr(uint8_t entry)
{
    assert_param(entry < PPT_ENTRY_NUM);
    return Bzdma_Manager.BleTxEntSta[entry].seg_rptr;
}

PPT_API_SECTION void ppt_set_tx_fifo_rdptr(uint8_t entry, uint8_t ptr)
{
    assert_param(entry < PPT_ENTRY_NUM);
    Bzdma_Manager.BleTxEntSta[entry].seg_rptr = ptr;
}

PPT_API_SECTION uint8_t ppt_get_tx_fifo_wrptr(uint8_t entry)
{
    assert_param(entry < PPT_ENTRY_NUM);
    return Bzdma_Manager.BleTxEntSta[entry].seg_wptr;
}

PPT_API_SECTION uint8_t ppt_get_tx_fifo_pend_pkt_num(uint8_t entry)
{
    assert_param(entry < PPT_ENTRY_NUM);
    return bzdma_supported_le_max_seg_num - Bzdma_Manager.BleTxEntSta[entry].free_segs;
}

PPT_API_SECTION uint8_t ppt_get_tx_fifo_free_pkt_num(uint8_t entry)
{
    assert_param(entry < PPT_ENTRY_NUM);
    return Bzdma_Manager.BleTxEntSta[entry].free_segs;
}

PPT_API_SECTION void ppt_reset_tx_fifo(uint8_t entry)
{
    ppt_set_tx_fifo_rdptr(entry, PPT_TX_FIFO_SIZE - 1);
    ppt_force_fw_ack(entry);
    ppt_flush_tx_fifo(entry);
}

PPT_API_SECTION int8_t ppt_get_rssi(uint16_t rssi_raw)
{
    return calculate_log_from_rssi(rssi_raw, 0xff, PPT_RF_MODE);
}

void ppt_init_dma(void)
{
    bzdma_supported_le_max_seg_num = PPT_TX_FIFO_SIZE;
    for (uint8_t loop = 0; loop < PPT_ENTRY_NUM; loop++)
    {
        Bzdma_Manager.BleTxEntSta[loop].seg_rptr = 0;
        Bzdma_Manager.BleTxEntSta[loop].seg_wptr = 0;
        Bzdma_Manager.BleTxEntSta[loop].free_segs = bzdma_supported_le_max_seg_num;
        bzdma_ble_set_segment_valid_bitmap(loop, 0);
    }
}

void ppt_deinit_dma(void)
{
    bzdma_supported_le_max_seg_num = 16;
    for (uint8_t loop = 0; loop < PPT_ENTRY_NUM; loop++)
    {
        Bzdma_Manager.BleTxEntSta[loop].seg_rptr = PPT_TX_FIFO_SIZE - 1;
        ppt_force_fw_ack(loop);
        Bzdma_Manager.BleTxEntSta[loop].seg_wptr = 0;
        Bzdma_Manager.BleTxEntSta[loop].free_segs = bzdma_supported_le_max_seg_num;
        bzdma_ble_set_segment_valid_bitmap(loop, 0);
    }
}

void ppt_init_misc(void)
{
#if PATCH_BTMAC_ISR
    btmac_handler_temp = rcp_BTMAC_Handler;
    rcp_BTMAC_Handler = (PF_ROM_CODE_PATCH_FUNC)btmac_isr_handler;
#else
    RamVectorTableUpdate(BTMAC_VECTORn, btmac_isr_handler);
#endif
    bb_psd_handler_temp = rcp_BB_handle_psd_end_intr_func;
    rcp_BB_handle_psd_end_intr_func = (PF_ROM_CODE_PATCH_FUNC)btmac_psd_isr_handler;

    /* modem init 1: proprietary mode, 0: normal mode */
    RTK_UPDATE_MODEM_REG_PI(MODEM_PI_PAGE_0, TRANS_MODEM_REG(0x66), BIT15, BIT15);
    /* force tx gain */
    //RTK_WRITE_MODEM_REG_PI(MODEM_PI_PAGE_3, TRANS_MODEM_REG(0x5c), 0x7840);

    /* workaround for rx empty pkt */
    //uint16_t reg = ((uint16_t) * ((volatile uint16_t *)(0x40050000 + 0x18e)));
    //TODO: BB_write_baseband_register(0x18e, reg | BIT15);
}

void ppt_deinit_misc(void)
{
    //uint16_t reg = ((uint16_t) * ((volatile uint16_t *)(0x40050000 + 0x18e)));
    //TODO: BB_write_baseband_register(0x18e, reg & (~BIT15));

    RTK_UPDATE_MODEM_REG_PI(MODEM_PI_PAGE_0, TRANS_MODEM_REG(0x66), BIT15, 0);
    //TODO:ll_hw_init(false);

#if PATCH_BTMAC_ISR
    rcp_BTMAC_Handler = (PF_ROM_CODE_PATCH_FUNC)btmac_handler_temp;
#else
    RamVectorTableUpdate(BTMAC_VECTORn, BTMAC_Handler);
#endif
    rcp_BB_handle_psd_end_intr_func = (PF_ROM_CODE_PATCH_FUNC)bb_psd_handler_temp;
}

PPT_API_SECTION uint32_t ppt_crc_eng_cal(ppt_crc_eng_param_t *param, uint8_t *data,
                                         uint32_t data_len)
{
    uint32_t crc_hw = 0;
    uint32_t init = param->init;

    WR_PPT_REG(PRO_CRC_ENGINE_POLY, param->poly & 0xffff);
    WR_PPT_REG(PRO_CRC_ENGINE_POLY1, (param->poly >> 16) & 0xffff);
    WR_PPT_REG_FIELD(PRO_CRC_ENGINE_EN, crc_engine_field_length, param->length >> 3);
    WR_PPT_REG_FIELD(PRO_CRC_ENGINE_EN, crc_engine_data_length_in_bit, param->bit_mode);
    WR_PPT_REG_FIELD(PRO_CRC_ENGINE_EN, crc_engine_input_endian, param->input_endian);
    WR_PPT_REG_FIELD(PRO_CRC_ENGINE_EN, crc_engine_output_endian, 0);

    uint8_t step_len = param->bit_mode ? 40 : 5;
    for (uint32_t loop = 0; loop < data_len; loop += step_len)
    {
        if (param->output_endian && loop + step_len >= data_len)
        {
            WR_PPT_REG_FIELD(PRO_CRC_ENGINE_EN, crc_engine_output_endian, 1);
        }

        WR_PPT_REG(PRO_CRC_ENGINE_INIT, init & 0xffff);
        WR_PPT_REG(PRO_CRC_ENGINE_INIT1, (init >> 16) & 0xffff);

        uint32_t data_idx = param->bit_mode ? (loop >> 3) : loop;
        WR_PPT_REG(PRO_CRC_ENGINE_IN, data[data_idx + 0] + (data[data_idx + 1] << 8));
        WR_PPT_REG(PRO_CRC_ENGINE_IN1, data[data_idx + 2] + (data[data_idx + 3] << 8));
        WR_PPT_REG_FIELD(PRO_CRC_ENGINE_IN2, crc_engine_input_data_39_32, data[data_idx + 4]);

        uint8_t len = data_len - loop;
        if (len > step_len)
        {
            len = step_len;
        }
        WR_PPT_REG_FIELD(PRO_CRC_ENGINE_EN, crc_engine_data_length, param->bit_mode ? len : len - 1);

        WR_PPT_REG_FIELD(PRO_CRC_ENGINE_EN, crc_engine_en, 1);
        while (1)
        {
            bool run = RD_PPT_REG_FIELD(PRO_CRC_ENGINE_EN, crc_engine_en);
            if (run == false)
            {
                break;
            }
        }

        uint16_t crc_l = RD_PPT_REG(PRO_CRC_ENGINE_OUT);
        uint16_t crc_h = RD_PPT_REG(PRO_CRC_ENGINE_OUT1);
        crc_hw = (crc_h << 16) + crc_l;
        init = crc_hw;
    }

    if (param->output_endian == 1)
    {
        crc_hw >>= 32 - param->length;
    }
    return crc_hw;
}

