rtkconnectivity/rtl8752h_sdk/src/app/ppt_driver/common/ppt_driver.c
void ppt_reg_handler(void (*handler)(void))
{
    ppt_isr_handler = handler;
}

void ppt_reg_psd_handler(void (*handler)(void))
{
    ppt_psd_isr_handler = handler;
}

#if TIME_DEBUG
void ppt_init_time_debug(void)
{
    RCC_PeriphClockCmd(APBPeriph_GPIO, APBPeriph_GPIO_CLOCK, (FunctionalState)ENABLE);
    for (uint8_t loop = 0; loop < sizeof(test_pin) / sizeof(test_pin[0]); loop++)
    {
        Pad_Config(test_pin[loop], PAD_PINMUX_MODE, PAD_IS_PWRON, PAD_PULL_NONE, PAD_OUT_DISABLE,
                   PAD_OUT_HIGH);
        Pinmux_Config(test_pin[loop], DWGPIO);
        gpio_test_pin[loop] = GPIO_GetPin(test_pin[loop]);
        GPIO_InitTypeDef GPIO_InitStruct;
        GPIO_StructInit(&GPIO_InitStruct);
        GPIO_InitStruct.GPIO_Pin        = gpio_test_pin[loop];
        GPIO_InitStruct.GPIO_Mode       = GPIO_Mode_OUT;
        GPIO_Init(&GPIO_InitStruct);
        GPIO->DATAOUT |= gpio_test_pin[loop];
        GPIO->DATAOUT &= ~gpio_test_pin[loop];
    }
}

PPT_API_SECTION void ppt_store_time_debug(void)
{
    for (uint8_t loop = 0; loop < sizeof(test_pin) / sizeof(test_pin[0]); loop++)
    {
        Pad_Config(test_pin[loop], PAD_SW_MODE, PAD_IS_PWRON, PAD_PULL_NONE, PAD_OUT_ENABLE,
                   level_test_pin[loop] ? PAD_OUT_HIGH : PAD_OUT_LOW);
    }
}

PPT_API_SECTION void ppt_restore_time_debug(void)
{
    for (uint8_t loop = 0; loop < sizeof(test_pin) / sizeof(test_pin[0]); loop++)
    {
        Pad_Config(test_pin[loop], PAD_PINMUX_MODE, PAD_IS_PWRON, PAD_PULL_NONE, PAD_OUT_DISABLE,
                   PAD_OUT_HIGH);
    }
}
#endif

PPT_API_SECTION static PMCheckResult ppt_dlps_mac_check(uint32_t cur_clk,
                                                        uint32_t pre_sys_lv_wakeup_time_diff,
                                                        uint32_t *unit_wakeup_time_diff)
{
    if (ppt_enable == false)
    {
        return PM_CHECK_PASS;
    }
    //DBG_DIRECT("ppt mac check");
    //DBG_DIRECT("ppt mac check %04x, %04x", RD_PPT_REG(PRO_DSM_READ), RD_PPT_REG(PRO_DSM_READ1));

    BT_SYS_CTRL_REG_S_TYPE bt_sys_reg;
    bt_sys_reg.d32 = VENDOR_READ(BT_SYS_CTRL_REG);
    if (bt_sys_reg.b.pro_rst_n != 0)
    {
        uint16_t pro_dsm = RD_PPT_REG(PRO_DSM_READ);
        if ((pro_dsm & (BIT6 + BIT11 + BIT12)) != (BIT6 + BIT11 + BIT12))
        {
            return PM_CHECK_FAIL;
        }
        uint16_t pro_dsm1 = RD_PPT_REG(PRO_DSM_READ1);
        if ((pro_dsm1 & (BIT0 + BIT7 + BIT13)) != (BIT0 + BIT7 + BIT13))
        {
            return PM_CHECK_FAIL;
        }
        if ((pro_dsm1 & (BIT1 + BIT2)) != 0)
        {
            return PM_CHECK_FAIL;
        }
        uint16_t isr_sta = RD_PPT_REG(PRO_MISR) & PPT_ISR_VALID_BITS_MASK;
        uint16_t isr_msk = RD_PPT_REG(PRO_IMR) & PPT_ISR_VALID_BITS_MASK;
        if (isr_sta & (~isr_msk))
        {
            return PM_CHECK_FAIL;
        }
    }

    if (ppt_dlps_mac_idle == false)
    {
        return PM_CHECK_FAIL;
    }
    if (ppt_dlps_mac_check_cb != NULL)
    {
        if (ppt_dlps_mac_check_cb(unit_wakeup_time_diff) == false)
        {
            return PM_CHECK_FAIL;
        }
    }
    return PM_CHECK_PASS;
}

PPT_API_SECTION static void ppt_dlps_mac_store(void)
{
    if (ppt_enable == false)
    {
        return;
    }

    if (ppt_dlps_mac_enter_cb)
    {
        ppt_dlps_mac_enter_cb();
    }

    ppt_read_reg = ppt_read_reg_dlps;
    ppt_write_reg = ppt_write_reg_dlps;
}

PPT_API_SECTION static void ppt_dlps_mac_restore(void)
{
    if (ppt_enable == false)
    {
        return;
    }
    //DBG_DIRECT("ppt mac restore");

    ppt_reset_core_domain(true);
    ppt_read_reg = ppt_read_reg_active;
    ppt_write_reg = ppt_write_reg_active;

    for (uint8_t loop = 0; loop < PPT_ENTRY_RX_NUM; loop++)
    {
        if (ppt_fw_ret.modem_acc_enable & BIT(loop))
        {
            uint32_t base_for_modem = ppt_fw_ret.modem_acc[loop];
            if (loop == 0)
            {
                RTK_WRITE_MODEM_REG_PI(MODEM_PI_PAGE_0, TRANS_MODEM_REG(0x1c), base_for_modem);
                RTK_WRITE_MODEM_REG_PI(MODEM_PI_PAGE_0, TRANS_MODEM_REG(0x1e), base_for_modem >> 16);
            }
            else if (loop == 1)
            {
                RTK_WRITE_MODEM_REG_PI(MODEM_PI_PAGE_0, TRANS_MODEM_REG(0x24), base_for_modem);
                RTK_WRITE_MODEM_REG_PI(MODEM_PI_PAGE_0, TRANS_MODEM_REG(0x26), base_for_modem >> 16);
            }
        }
    }

    if (ppt_fw_ret.acc_byte3_flag == 2)/* 2M PHY */
    {
        /* need restore after dlps */
        RTK_UPDATE_MODEM_REG_PI(MODEM_PI_PAGE_0, TRANS_MODEM_REG(0x10), 0x1 << 3, 0x0 << 3);
    }
    else if (ppt_fw_ret.acc_byte3_flag == 1)/* 1M PHY */
    {
        /* need restore after dlps */
        RTK_UPDATE_MODEM_REG_PI(MODEM_PI_PAGE_2, TRANS_MODEM_REG(0x68), 0x7 << 9, 0x1 << 9);
    }

    if (ppt_fw_ret.acc_similar_flag)
    {
        RTK_UPDATE_MODEM_REG_PI(MODEM_PI_PAGE_6, TRANS_MODEM_REG(0x4a), 0xff << 0, 0x33 << 0);
        /* 1M PHY */
        {
            RTK_UPDATE_MODEM_REG_PI(MODEM_PI_PAGE_0, TRANS_MODEM_REG(0x2C), 0x7 << 13, 0x0 << 13);
        }
    }

    if (ppt_fw_ret.mod_index_2m_flag)
    {
        RTK_UPDATE_MODEM_REG_PI(MODEM_PI_PAGE_2, TRANS_MODEM_REG(0x14), 0x3f, 0x28);
        RTK_UPDATE_MODEM_REG_PI(MODEM_PI_PAGE_6, TRANS_MODEM_REG(0x2c), 0x3fe, 0x50);
    }

    if (ppt_dlps_mac_exit_cb)
    {
        ppt_dlps_mac_exit_cb();
    }
}

PPT_API_SECTION static void ppt_dlps_pf_enter(void)
{
    if (ppt_enable == false)
    {
        return;
    }
    //DBG_DIRECT("ppt pf enter");
    if (ppt_dlps_pf_enter_cb)
    {
        ppt_dlps_pf_enter_cb();
    }
#if TIME_DEBUG
    ppt_store_time_debug();
#endif
}

PPT_API_SECTION static void ppt_dlps_pf_exit(void)
{
    if (ppt_enable == false)
    {
        return;
    }
    //DBG_DIRECT("ppt pf exit");
#if TIME_DEBUG
    ppt_restore_time_debug();
#endif
    if (ppt_dlps_pf_exit_cb)
    {
        ppt_dlps_pf_exit_cb();
    }
}

void ppt_dlps_init(void)
{
    /* no way to unregister callback, so only register once */
    static bool ppt_dlps_pf_cb_reg = false;
    if (ppt_dlps_pf_cb_reg == false)
    {
        ppt_dlps_pf_cb_reg = true;
        platform_pm_register_callback_func(ppt_dlps_pf_enter, PLATFORM_PM_STORE);
        platform_pm_register_callback_func(ppt_dlps_pf_exit, PLATFORM_PM_PEND);

        PowerManagerSlaveUnit *ppt_pm = (PowerManagerSlaveUnit *)os_mem_zalloc(RAM_TYPE_DATA_ON,
                                                                               sizeof(PowerManagerSlaveUnit));
        ppt_pm->check_func = ppt_dlps_mac_check;
        ppt_pm->enter_func = ppt_dlps_mac_store;
        ppt_pm->exit_func = ppt_dlps_mac_restore;
        ppt_pm->unit_id = PM_UNIT_PROPRIETARY;
        power_manager_slave_register_unit(PM_UNIT_PROPRIETARY, ppt_pm);
    }
}

void ppt_dlps_deinit(void)
{
    ppt_read_reg = ppt_read_reg_def;
    ppt_write_reg = ppt_write_reg_def;
}

PPT_API_SECTION bool ppt_dlps_check_active(void)
{
    return (power_manager_interface_get_unit_status(PM_SLAVE_PROPRIETARY,
                                                    PM_UNIT_PROPRIETARY) == PM_UNIT_ACTIVE);
}

PPT_API_SECTION bool ppt_dlps_check_inactive(void)
{
    return (power_manager_interface_get_unit_status(PM_SLAVE_PROPRIETARY,
                                                    PM_UNIT_PROPRIETARY) == PM_UNIT_INACTIVE);
}

PPT_API_SECTION void ppt_dlps_initiate_wakeup(void)
{
    power_manager_master_initiate_wakeup(PM_SLAVE_PROPRIETARY,
                                         (PMSystemLevel)((PM_UNIT_PROPRIETARY >> 2) & 0x3),
                                         PM_UNIT_PROPRIETARY);
    while (ppt_dlps_check_inactive());
}

void ppt_dlps_reg_mac_check_cb(bool (*check_cb)(uint32_t *wakeup_time_diff))
{
    ppt_dlps_mac_check_cb = check_cb;
}

void ppt_dlps_reg_mac_enter_cb(void (*enter_cb)(void))
{
    ppt_dlps_mac_enter_cb = enter_cb;
}

void ppt_dlps_reg_mac_exit_cb(void (*exit_cb)(void))
{
    ppt_dlps_mac_exit_cb = exit_cb;
}

void ppt_dlps_reg_pf_enter_cb(void (*enter_cb)(void))
{
    ppt_dlps_pf_enter_cb = enter_cb;
}

void ppt_dlps_reg_pf_exit_cb(void (*exit_cb)(void))
{
    ppt_dlps_pf_exit_cb = exit_cb;
}
